<br><br><center><h1 style="font-size:2em;color:#2467C0">Tagesaufgaben: Pandas Aggregationen</h1></center>
<br>

In [1]:
# Importiere, was du so fürs Leben brauchst ;)
import numpy as np
import pandas as pd

Aufgabe 1:
Verwende den Datensatz "Data Science Salaries 2024" von gestern weiter, lade ihn mit Pandas und speichere das Ergebnis in die Variabel salaries.

In [62]:
salaries = pd.read_csv('data_science_salaries.csv')
salaries

,job_title,experience_level,employment_type,work_models,work_year,employee_residence,salary,salary_currency,salary_in_usd,company_location,company_size
0,Data Engineer,Mid-level,Full-time,Remote,2024,United States,148100,USD,148100,United States,Medium
1,Data Engineer,Mid-level,Full-time,Remote,2024,United States,98700,USD,98700,United States,Medium
2,Data Scientist,Senior-level,Full-time,Remote,2024,United States,140032,USD,140032,United States,Medium
3,Data Scientist,Senior-level,Full-time,Remote,2024,United States,100022,USD,100022,United States,Medium
4,BI Developer,Mid-level,Full-time,On-site,2024,United States,120000,USD,120000,United States,Medium
...,...,...,...,...,...,...,...,...,...,...,...
6594,Staff Data Analyst,Entry-level,Contract,Hybrid,2020,Canada,60000,CAD,44753,Canada,Large
6595,Staff Data Analyst,Executive-level,Full-time,On-site,2020,Nigeria,15000,USD,15000,Canada,Medium
6596,Machine Learning Manager,Senior-level,Full-time,Hybrid,2020,Canada,157000,CAD,117104,Canada,Large
6597,Data Engineer,Mid-level,Full-time,Hybrid,2020,Austria,65000,EUR,74130,Austria,Large
6598,Data Scientist,Senior-level,Full-time,On-site,2020,Austria,80000,EUR,91237,Austria,Small

Aufgabe 2:
Lasse dir das Durchschnittsgehalt je Erfahrungslevel ausgeben.

In [63]:
exp_lvl_mean = salaries.groupby('experience_level')\
    .agg(salary_usd_mean=('salary_in_usd', 'mean'))
exp_lvl_mean

                  salary_usd_mean
experience_level
Entry-level          84448.916814
Executive-level     189687.346457
Mid-level           119019.812537
Senior-level        162071.063581

Aufgabe 3:
Ermittle, wie viele Anstellungsarten es im Datensatz gibt und wie sie heißen. Führe dasselbe für Firmengrößen durch.

In [64]:
work_models = salaries['work_models'].unique()
comp_size = salaries['company_size'].unique()
print(work_models,'\n', comp_size)

['Remote' 'On-site' 'Hybrid']
 ['Medium' 'Large' 'Small']

Aufgabe 4:
Welches Durchschnittsgehalt gibt es in Abhängigkeit von der Firmengröße UND dem Anstellungsverhältnis?

In [65]:
size_work_models_mean = salaries.groupby(['work_models', 'company_size'])\
    .agg(salary_usd_mean=('salary_in_usd', 'mean'))
size_work_models_mean

                          salary_usd_mean
work_models company_size
Hybrid      Large            89441.889706
            Medium           70959.981132
            Small            78223.944444
On-site     Large           150104.415730
            Medium          153128.724195
            Small           105473.451613
Remote      Large           116708.113725
            Medium          145877.078983
            Small            85642.029126

Aufgabe 5:
In welchem Land verdient man durchschnittlich am besten?

In [66]:
best_location = salaries.groupby('company_location')['salary_in_usd'].max().sort_values(ascending=False)
best_location

company_location
United States     750000
United Kingdom    430967
Israel            417937
Canada            306400
Qatar             300000
                   ...
Malta              28369
Turkey             28016
Honduras           20000
Moldova            18000
Ecuador            16000
Name: salary_in_usd, Length: 75, dtype: int64

Aufgabe 6:
Hat die Arbeitssituation (Remote/on-site/weitere?) einen Einfluss auf das Gehalt? Führe die durchschnittlichen Gehälter auf.

In [67]:
mean_models = salaries.groupby('work_models')\
    .agg(salary_usd_mean=('salary_in_usd', 'mean'))

mean_models['salary_usd_mean'].sort_values(ascending=False)

work_models
On-site    152600.100970
Remote     140550.137837
Hybrid      83293.502222
Name: salary_usd_mean, dtype: float64

Aufgabe 7:
Beantworte in einem Dataframe:
* Was ist das häufigste Jahr für das jeweilige Arbeitsplatzmodell im Datensatz?
(Tipp: Informiere dich über den Modus bei Series von Pandas!)
* Was ist das maximale Gehalt für das jeweilige Arbeitsplatzmodell im Datensatz?

In [68]:
year_models_max = salaries.groupby('work_models')['work_year']\
    .agg(pd.Series.mode)

year_models_max

work_models
Hybrid     2021
On-site    2023
Remote     2023
Name: work_year, dtype: int64

In [69]:
max_salary_model = salaries.groupby('work_models')['salary_in_usd'].max()
max_salary_model.sort_values(ascending=False)

work_models
On-site    750000
Remote     700000
Hybrid     423000
Name: salary_in_usd, dtype: int64

Aufgabe 8:
Dein Chef wieder. Er will, dass du nach Firmengröße folgende Informationen sammelst UND die Spalten benennst:
* Welcher Job-Titel ist am häufigsten vertreten? (Spalte: most_work_as)
* Welches Arbeitsplatzmodell ist am häufigsten vertreten? (Spalte: most_work)
* Das jeweilige Durchschnittsgehalt (Spalte: average_pay)
* Das erfasste niedrigste Gehalt je Firmengröße (Spalte: min_pay)
* Das erfasste höchste Gehalt je Firmengröße (Spalte: max_pay)

In [72]:
most_work_as = salaries.groupby('company_size')\
    .agg(most_work_as=('job_title', 'max'))

most_work_as

                                 most_work_as
company_size
Large                      Staff Data Analyst
Medium        Staff Machine Learning Engineer
Small                      Staff Data Analyst

In [73]:
most_work = salaries.groupby('company_size')\
    .agg(most_work=('work_models', 'max'))

most_work

             most_work
company_size
Large           Remote
Medium          Remote
Small           Remote

In [74]:
avg_pay = salaries.groupby('company_size')\
    .agg(avgerage_pay=('salary_in_usd', 'mean'))

avg_pay

               avgerage_pay
company_size
Large         120638.404218
Medium        149659.386689
Small          87687.458824

In [75]:
min_pay = salaries.groupby('company_size')\
    .agg(min_pay=('salary_in_usd', 'min'))

min_pay

              min_pay
company_size
Large           15000
Medium          15000
Small           15809

In [76]:
max_pay = salaries.groupby('company_size')\
    .agg(max_pay=('salary_in_usd', 'max'))

max_pay

              max_pay
company_size
Large          423000
Medium         750000
Small          416000

Aufgabe 9:
Du hast nicht genug? Dann überlege dir weitere Aggregationen und verdichtete Informationen zu diesem Datensatz, die dich interessieren. ;)

In [78]:
overall_bliblablub = salaries.groupby(['job_title', 'company_size', 'company_location', 'work_models'])\
    .agg(mean_pay=('salary_in_usd', 'mean'))

overall_bliblablub

                                                                                mean_pay
job_title                       company_size company_location work_models
AI Architect                    Large        United States    Remote       207968.000000
                                Medium       United States    On-site      242108.333333
                                                              Remote       226000.000000
AI Developer                    Large        Germany          Remote       215936.000000
                                             United States    Remote       130000.000000
...                                                                                  ...
Staff Data Analyst              Medium       Canada           On-site       15000.000000
                                Small        Saudi Arabia     Remote       179998.000000
Staff Data Scientist            Medium       United States    Hybrid       164000.000000
                                                              Remote       105000.000000
Staff Machine Learning Engineer Medium       United States    Hybrid       185000.000000

[812 rows x 1 columns]